# IsEqual Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayColoredSurfaceSettings..::..IsEqual Method
AnalysisDisplayColoredSurfaceSettings Class See Also
---
Compares two colored surface settings objects.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool IsEqual(
	AnalysisDisplayColoredSurfaceSettings other
)
```

Visual Basic
---
```text
Public Function IsEqual ( _
	other As AnalysisDisplayColoredSurfaceSettings _
) As Boolean
```

Visual C++
---
```text
public:
bool IsEqual(
	AnalysisDisplayColoredSurfaceSettings^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB.Analysis..::..AnalysisDisplayColoredSurfaceSettings Colored surface settings object to compare with.
# ### Return Value
True if objects are equal, false otherwise.
# See Also
AnalysisDisplayColoredSurfaceSettings Class
Autodesk.Revit.DB.Analysis Namespace